# ElectricalPerPhaseData Properties

---
The ElectricalPerPhaseData type exposes the following members.
| Name| Description
---|---|---
| CurrentPhaseA|  The effective value of current on electrical phase A.
| CurrentPhaseB|  The effective value of current on electrical phase B.
| CurrentPhaseC|  The effective value of current on electrical phase C.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
ElectricalPerPhaseData Class
Autodesk.Revit.DB.Electrical Namespace